import Breadcrumbs from "@/components/shared/breadcrumbs";
import Footer from "@/components/shared/footer";
import Header from "@/components/shared/header";
import Image from "next/image";

export const metadata = {
  title: "Договір публічної оферти",
  description: "Офіційний Договір публічної оферти нашого сайту.",
};

const PublicOfferPage = () => {
  return (
    <section className="bg-first mx-auto h-full max-w-[1440px] overflow-x-hidden px-80px pb-[32px]">
      <Header />

      <Breadcrumbs
        items={["Головна сторінка", "/", "Договір публічної офрети"]}
      />

      <h1 className="text-h3 leading-[120%] text-justify mt-[60px] flex justify-center">
        Договір публічної оферти
      </h1>

      <div className="mt-7 max-w-[958px]">
        <p className="font-semibold">Інтернет-магазин «Cozy Corners»</p>
        <p className="mt-4 leading-[120%]">
          Цей договір є публічною офертою (далі – Договір) і регулює умови
          купівлі-продажу товарів через веб-сайт інтернет-магазину «Cozy
          Corners» (www.cozycorners.ua) (далі – Продавець) для будь-якої
          фізичної або юридичної особи, що здійснює покупку (далі – Покупець).
        </p>

        <ul className="marker:text-accent relative list-outside list-disc pl-6 mt-4 gap-y-4 flex flex-col leading-[120%]">
          <li>
            Якщо під час отримання товару ви виявили, що він не відповідає
            вашому замовленню або <br /> пошкоджений, повідомте про це кур’єра
            або менеджера пункту видачі. Вони організують <br /> повернення або
            обмін без зайвих клопотів.
          </li>
          <li>
            Для товарів, доставлених через поштові служби, повернення можливе
            тільки всієї посилки в <br /> оригінальному вигляді (не відкривайте
            упаковку інших товарів із замовлення).
          </li>
        </ul>

        <p className="mt-[52px] pl-2 font-semibold">1. ЗАГАЛЬНІ ПОЛОЖЕННЯ</p>
        <p className="mt-4 leading-[120%]">
          1.1. Цей Договір є публічною пропозицією укласти договір
          купівлі-продажу відповідно до статей 633, 641 та 642 Цивільного
          кодексу України.
        </p>
        <p className="mt-4">
          1.2. Прийняттям цього Договору вважається оформлення замовлення
          Покупцем на сайті Продавця.
        </p>

        <p className="font-semibold mt-[52px] pl-2">2. ПРЕДМЕТ ДОГОВОРУ</p>
        <p className="leading-[120%] mt-3 mb-3">
          2.1. Продавець зобов'язується передати у власність Покупця товари,
          обрані ним у каталозі на веб-
          <br />
          сайті, а Покупець зобов'язується прийняти та оплатити їх.
        </p>
        <p>
          2.2. Цей Договір поширюється на всі товари, представлені на сайті на
          момент замовлення.
        </p>

        <p className="font-semibold mt-[52px] pl-2">3. ОФОРМЛЕННЯ ЗАМОВЛЕННЯ</p>
        <p className="leading-[120%] my-3">
          3.1. Покупець оформлює замовлення самостійно через інтернет-магазин
          або за допомогою <br /> менеджера Продавця.
        </p>
        <p>
          3.2. Замовлення вважається прийнятим після підтвердження менеджером
          Продавця.
        </p>

        <p className="font-semibold mt-[52px] pl-1">4. УМОВИ ОПЛАТИ</p>
        <p className="my-3">
          4.1. Покупець оплачує замовлення одним із способів, зазначених на
          сайті.
        </p>
        <p className="leading-[120%]">
          4.2. У разі передоплати відправлення товару здійснюється після
          зарахування коштів на рахунок <br /> Продавця.
        </p>

        <p className="font-semibold mt-[52px] pl-1">
          5. ДОСТАВКА ТА ПЕРЕДАЧА ТОВАРУ
        </p>
        <p className="my-3">
          5.1. Продавець здійснює доставку товару за адресою, вказаною Покупцем.
        </p>
        <p className="leading-[120%]">
          5.2. Покупець зобов'язується перевірити товар під час отримання. У
          разі виявлення дефектів або <br /> невідповідності повідомити Продавця
          протягом 24 годин.
        </p>

        <p className="font-semibold mt-[54px] pl-1">6. ПОВЕРНЕННЯ ТОВАРУ</p>
        <p className="my-3">
          6.1. Повернення товару здійснюється відповідно до Закону України «Про
          захист прав споживачів».
        </p>
        <p className="leading-[120%]">
          6.2. Товар належної якості можна повернути протягом 14 днів за умови
          збереження товарного <br /> вигляду, упаковки та документів, що
          підтверджують покупку.
        </p>

        <p className="font-semibold mt-[56px] pl-1">
          7. ГАРАНТІЙНІ ЗОБОВ’ЯЗАННЯ
        </p>
        <p className="my-3">
          7.1. На товари поширюється гарантія від виробника, умови якої
          зазначені у супровідній документації.
        </p>
        <p className="leading-[120%]">
          7.2. Гарантійні зобов’язання не поширюються на пошкодження, спричинені
          неправильним <br /> використанням товару.
        </p>

        <p className="font-semibold mt-[52px] pl-1">
          8. ВІДПОВІДАЛЬНІСТЬ СТОРІН
        </p>
        <p className="mt-3">8.1. Продавець не несе відповідальності за:</p>
        <ul className="marker:text-accent relative list-outside list-disc pl-6 leading-[120%]">
          <li>затримки у доставці, спричинені транспортними службами;</li>
          <li>неправильне використання товару Покупцем.</li>
        </ul>
        <p className="mt-3">
          8.2. Покупець несе відповідальність за достовірність наданих
          контактних даних.
        </p>

        <p className="font-semibold mt-[52px] pl-1">9. ІНШІ УМОВИ</p>
        <p className="my-3 leading-[120%]">
          9.1. Цей Договір є дійсним з моменту оформлення замовлення і діє до
          виконання сторонами своїх <br /> зобов'язань.
        </p>
        <p className="leading-[120%]">
          9.2. Усі спірні питання вирішуються шляхом переговорів, а за їх
          неможливості – у судовому порядку <br /> відповідно до законодавства
          України.
        </p>

        <p className="font-semibold mt-[56px] ">10. КОНТАКТНА ІНФОРМАЦІЯ</p>
        <div className="mt-3 flex flex-col gap-y-3">
          <p>Продавець: Вороніна Валентина Олексіївна</p>
          <p>Назва: Cozy Corners</p>
          <p>Адреса: вул. Львівська, 11</p>
          <p>Телефон: +380 ( 011) 621 16 12</p>
          <p>Електронна пошта: cozycorners@gmail.com</p>
        </div>
      </div>

      <Footer />
    </section>
  );
};

export default PublicOfferPage;
