import AnimatedSection from "@/components/shared/animatedSection";

export const metadata = {
  title: "Політика Конфіденційності",
  description: "Офіційна політика конфіденційності нашого сайту.",
};

const PrivacyPolicyPage = () => {
  return (
    <AnimatedSection>
      <h1 className="text-h3 leading-[120%] text-justify mt-[60px] flex justify-center">
        Політика конфіденційності
      </h1>

      <p className="leading-[120%] mt-8">
        Захист вашої інформації та повага до конфіденційності ваших даних під
        час використання нашого Сайту мають для нас <br /> першорядне значення,
        тому ми вживаємо належних заходів безпеки та дбаємо про зручність
        використання наших сайтів. <br /> Ця Політика встановлює правила та
        рамки обробки ваших даних, а також пов&apos;язані з цим ваші права та
        обов&apos;язки.
      </p>

      <p className="font-semibold mt-[52px]">
        Цілі та правові підстави обробки персональних даних
      </p>
      <p className="font-semibold mt-1">
        1. Здійснення покупок та отримання послуг онлайн
      </p>

      <p className="mt-[45px] text-[20px] leading-[120%]">
        Ми обробляємо ваші дані в обсязі, необхідному для укладання та <br />{" "}
        виконання договору купівлі-продажу та надання інших послуг, таких як:
      </p>

      <ul className="marker:text-accent list-outside list-disc pl-6 mt-6 flex flex-col gap-y-[18px] leading-[120%]">
        <li>
          надання доступу до Сайтів та мобільних додатків з метою представлення
          та продажу наших товарів;
        </li>
        <li>реєстрація Облікового запису на Сайті;</li>
        <li>реєстрація Облікового запису на Сайті;</li>
        <li>запуск постійних і періодичних рекламних програм;</li>
        <li>
          обробка здійснених транзакцій, яка включає, наприклад, розрахунки за
          платежами та відправлення товарів;
        </li>
        <li>
          розгляд і обробка запитів, пов’язаних з правами споживача, наприклад,
          у межах встановленої законом <br /> гарантії чи повернення товару як
          до, так і після укладання договору купівлі-продажу, зокрема шляхом
          прямого <br /> контакту (телефон, електронна пошта);
        </li>
        <li>
          оцінка та вимірювання даних, пов’язаних із процесом покупки, включаючи
          повернення та скасування, <br /> здійснені Користувачем;
        </li>
        <li>
          оцінка та вимірювання даних, пов’язаних із процесом покупки, включаючи
          повернення та скасування, <br /> здійснені Користувачем;
        </li>
      </ul>

      <p className="mt-3 leading-[120%]">
        У разі укладання та виконання договору та надання послуг, якими ви
        хочете скористатися, ваші <br /> персональні дані обробляються на
        підставі укладеного договору купівлі-продажу (ст. 6(1)(b) ЗРЗД).
      </p>

      <p className="mt-14 font-semibold leading-[120%]">
        2. Представлення товарів і послуг
      </p>
      <p className="text-[20px] mt-1">
        Ваші дані також можуть оброблятись для:
      </p>

      <ul className="marker:text-accent list-outside list-disc pl-6 mt-6 flex flex-col gap-y-[18px] leading-[120%]">
        <li className="mt-6">
          аналізу частоти відображення товарів на Сайті та представлення товарів
          і послуг <br /> компанії
        </li>
      </ul>

      <p className="mt-14 font-semibold leading-[120%]">
        3. Оптимізація послуг
      </p>
      <p className="text-[20px] leading-[120%] mt-1">
        З метою вдосконалення наших бізнес-операцій та захисту інтересів
        компанії ваші <br /> дані обробляються для того, щоб:
      </p>

      <ul className="marker:text-accent list-outside list-disc pl-6 pt-6 mt-6 flex flex-col gap-y-[18px] leading-[120%]">
        <li>
          покращувати обслуговування клієнтів, яке надається відділом
          обслуговування клієнтів, зокрема шляхом <br /> впровадження рішень, що
          спрощують обробку зареєстрованих проблем (автоматизація
          обслуговування);
        </li>
        <li>запобігати шахрайству;</li>
        <li>
          забезпечувати дотримання прав споживачів, обумовлених укладанням
          договору (право на подання скарг <br /> чи повернення товару);
        </li>
        <li>
          підтверджувати відповідність нашої діяльності вимогам закону, особливо
          у сфері дотримання прав <br /> споживачів та захисту персональних
          даних;
        </li>
        <li>
          обробка здійснених транзакцій, яка включає, наприклад, розрахунки за
          платежами та відправлення товарів;
        </li>
        <li>
          розгляд і обробка запитів, пов’язаних з правами споживача, наприклад,
          у межах встановленої законом <br /> гарантії чи повернення товару як
          до, так і після укладання договору купівлі-продажу, зокрема шляхом
          прямого <br /> контакту (телефон, електронна пошта);
        </li>
      </ul>

      <p className="mt-14 font-semibold leading-[120%]">
        Права суб&apos;єктів даних
      </p>
      <p className="text-[20px] leading-[120%] mt-1">
        У зв’язку з обробкою персональних даних ви маєте такі права:
      </p>

      <ul className="marker:text-accent list-outside list-disc pl-6 pt-6 mt-6 flex flex-col gap-y-[18px] leading-[120%]">
        <li>
          Самостійно видалити свій обліковий запис, запустивши процедуру
          видалення облікового запису
        </li>
        <li>
          Заперечувати проти повної або часткової обробки ваших даних або
          обробки з певною метою.
        </li>
        <li>
          Обмежувати обробку ваших даних на певний час або у певному обсязі.
        </li>
        <li>
          Виправляти або уточнювати свої персональні дані. Ви також можете
          вносити зміни самостійно, виконавши вхід на Сайт та перейшовши на
          вкладку «Дані облікового запису»
        </li>
        <li>Скасувати підписку на розсилку.</li>
        <li>Подати скаргу до органу нагляду за обробкою персональних даних;</li>
      </ul>
      <p className="mt-14 font-semibold leading-[120%]">
        Комерційна інформація - Розсилка
      </p>

      <p className="mt-12 leading-[120%] text-[20px] max-w-[877px] w-full">
        Ви можете підписатися на нашу розсилку, надавши свою адресу електронної
        пошти. Надаючи цю інформацію, ви погоджуєтесь отримувати комерційну
        інформацію виключно від компанії (електронною поштою або у текстових
        повідомленнях). Ми інформуємо вас про доступні товари та послуги,
        тренди, спеціальні пропозиції, розпродажі, дисконтні коди та незавершені
        покупки в інтернет-магазині за допомогою електронних засобів
        зв&apos;язку. Вас також можуть попросити висловити свою думку у формі
        опитувань. <br /> Ви можете у будь-який час скасувати підписку,
        натиснувши на посилання, що міститься у всіх наших повідомленнях, або
        надіславши електронного листа на адресу:cozycorners@com
      </p>

      <p className="text-[20px] mt-12">
        Ми раді, що ви обрали наші меблі для створення затишку у вашому домі.
      </p>
    </AnimatedSection>
  );
};

export default PrivacyPolicyPage;
